alert ("Здравствуй уважаемый пользователь");//так выводят сообщение
// так делают однострочные примечания
/*так делают многострочные примечания*/
var borderWidhLeft =1;/* переменная var есть даже когда до неё не дошла загрузка let  
только когда до неё дошла загрузка таким обазом let ускоряет загрузку*/
let second =2;
const pi=3.14;

let jaba
 {
    name ="animal",
    sum = 1,
    flei = false
}
 //console.log(typeof(5 + +"5"));
 
 let answer = prompt("Любишь ли ты путешествовать?","Да");
 console.log(answer);